system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-5 -16 -16)
    (-5 16 -16)
    (-5 16 16)
    (-5 -16 16)
    (245 -16 -16)
    (245 16 -16)
    (245 16 16)
    (245 -16 16)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type patch;
        faces
        (
	    (6 2 3 7)
            (0 4 7 3)
            (1 2 5 6)
            (4 0 1 5)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
   
);

mergePatchPairs
(
);

// ************************************************************************* //
