system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


movingwall.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
       includedAngle   150;
    }

    subsetFeatures
    {
	nonManifoldEdges	yes;
	
	openEdges	yes;

    }
    writeObj                yes;
}

fixedwall.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
       includedAngle   150;
    }
    subsetFeatures
    {
	nonManifoldEdges	yes;
	
	openEdges	yes;

    }

    writeObj                yes;
}

inlet.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
       includedAngle   150;
    }

    subsetFeatures
    {
	nonManifoldEdges	yes;
	
	openEdges	yes;

    }
    writeObj                yes;
}

bottomwall.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
       includedAngle   150;
    }

    subsetFeatures
    {
	nonManifoldEdges	yes;
	
	openEdges	yes;

    }
    writeObj                yes;
}

outlet.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
       includedAngle   150;
    }

    subsetFeatures
    {
	nonManifoldEdges	yes;
	
	openEdges	yes;

    }
    writeObj                yes;
}
// ************************************************************************* //
