system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    bottomwall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	{
	  patch bottomwall;
	}

    }

    {
        name    fixedwall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	{
	  patch fixedwall;
	}

    }

    {
        name    inlet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	{
	  patch inlet;
	}

    }

    {
        name    movingwall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	{
	  patch movingwall;
	}

    }

    {
        name    outlet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	{
	  patch outlet;
	}

    }


);

// ************************************************************************* //
